# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.rg_studio_law_test: Reading...
data.azurerm_resource_group.rg_studio_dev: Reading...
data.azurerm_resource_group.rg_studio_stag: Reading...
data.azurerm_resource_group.rg_studio_dev: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg]
data.azurerm_resource_group.rg_studio_stag: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg]
data.azurerm_client_config.current: Reading...
data.azurerm_monitor_data_collection_rule.prometheus: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_resource_group.rg_studio_law_test: Read complete after 1s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Reading...
data.azurerm_resource_group.rg_dp_prod: Reading...
data.azurerm_resource_group.rg_dp_prod: Read complete after 0s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg]
data.azurerm_log_analytics_workspace.studio_law_test: Read complete after 0s [id=/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-test-log]
data.azurerm_monitor_data_collection_rule.prometheus: Read complete after 0s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionRules/k6tests-amw]
data.azurerm_log_analytics_workspace.dp_law_prod: Reading...
data.azurerm_log_analytics_workspace.dp_law_prod: Read complete after 1s [id=/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-prod-insightsWorkspace]
data.azurerm_resource_group.rg_studio_law_prod: Reading...
data.azurerm_resource_group.rg_studio_prod: Reading...
data.azurerm_resource_group.rg_studio_prod: Read complete after 0s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg]
data.azurerm_resource_group.rg_studio_law_prod: Read complete after 0s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg]
data.azurerm_log_analytics_workspace.studio_law_prod: Reading...
data.azurerm_log_analytics_workspace.studio_law_prod: Read complete after 1s [id=/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.OperationalInsights/workspaces/altinn-studio-prod-log]
data.azurerm_resource_group.rg_dp_stag: Reading...
data.azurerm_resource_group.rg_dp_stag: Read complete after 0s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg]
data.azurerm_log_analytics_workspace.dp_law_stag: Reading...
data.azurerm_log_analytics_workspace.dp_law_stag: Read complete after 1s [id=/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-staging-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Reading...
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Reading...
data.azurerm_resource_group.rd_dp_test["dp-be-yt01-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg]
data.azurerm_resource_group.rd_dp_test["dp-be-test-rg"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-test-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-test-insightsWorkspace]
data.azurerm_log_analytics_workspace.dp_law_test["dp-be-yt01-insightsWorkspace"]: Read complete after 1s [id=/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.OperationalInsights/workspaces/dp-be-yt01-insightsWorkspace]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.spot will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "spot" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/spot"
        name                          = "spot"
      ~ node_count                    = 1 -> 0
        tags                          = {}
        # (30 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/resourceGroups/dp-be-prod-rg/providers/Microsoft.Authorization/roleAssignments/99313a5c-0a23-27a6-3b81-333670e90965" -> (known after apply)
      ~ name                                   = "99313a5c-0a23-27a6-3b81-333670e90965" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/c595f787-450d-4c57-84fa-abc5f95d5459/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_stag must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_stag" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/resourceGroups/dp-be-staging-rg/providers/Microsoft.Authorization/roleAssignments/ce527eed-b493-8541-c9e4-760f784eb68c" -> (known after apply)
      ~ name                                   = "ce527eed-b493-8541-c9e4-760f784eb68c" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/e4926efc-0577-47b3-9c3d-757925630eca/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-test-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-test-rg/providers/Microsoft.Authorization/roleAssignments/daa0af3e-8b1f-4f2b-e897-70688ebeaef4" -> (known after apply)
      ~ name                                   = "daa0af3e-8b1f-4f2b-e897-70688ebeaef4" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_dp_test["dp-be-yt01-rg"] must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_dp_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/resourceGroups/dp-be-yt01-rg/providers/Microsoft.Authorization/roleAssignments/6b5999ff-62f0-7352-563f-ea482d4211a2" -> (known after apply)
      ~ name                                   = "6b5999ff-62f0-7352-563f-ea482d4211a2" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/8a353de8-d81d-468d-a40d-f3574b6bb3f4/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_dev must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_dev" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-dev-rg/providers/Microsoft.Authorization/roleAssignments/9ed2ff20-2aba-02a5-81cd-acadcd0384a2" -> (known after apply)
      ~ name                                   = "9ed2ff20-2aba-02a5-81cd-acadcd0384a2" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_law_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_law_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/altinn-rg/providers/Microsoft.Authorization/roleAssignments/2d0271a2-2a7c-46c3-331d-f9125f33fbc2" -> (known after apply)
      ~ name                                   = "2d0271a2-2a7c-46c3-331d-f9125f33fbc2" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_law_test must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_law_test" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/altinn-rg/providers/Microsoft.Authorization/roleAssignments/33fed829-6033-5cdd-d165-1e831ef7cf1d" -> (known after apply)
      ~ name                                   = "33fed829-6033-5cdd-d165-1e831ef7cf1d" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_prod must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_prod" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/resourceGroups/studio-prod-rg/providers/Microsoft.Authorization/roleAssignments/1e159020-4270-db7e-d4d9-8c16bcae3ae6" -> (known after apply)
      ~ name                                   = "1e159020-4270-db7e-d4d9-8c16bcae3ae6" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/f66298ed-870c-40e0-bb74-6db89c1a364b/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_reader_rg_studio_stag must be replaced
-/+ resource "azurerm_role_assignment" "monitoring_reader_rg_studio_stag" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/resourceGroups/studio-staging-rg/providers/Microsoft.Authorization/roleAssignments/ef2bf060-189a-1c66-3b39-4fd0a91ee103" -> (known after apply)
      ~ name                                   = "ef2bf060-189a-1c66-3b39-4fd0a91ee103" -> (known after apply)
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/971ddbb1-27d0-4cc7-a016-461dab5cec05/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" -> "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/43d0d8ad-25c7-4714-9337-8ba259a9fe05" # forces replacement
      ~ role_definition_name                   = "Monitoring Reader" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # kubernetes_role_binding_v1.correspondence_dev_access will be destroyed
  # (because kubernetes_role_binding_v1.correspondence_dev_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "correspondence_dev_access" {
      - id = "correspondence/dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "18255996" -> null
          - uid              = "3d87b83d-44e0-4a63-b679-a260af339cc2" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "dev-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "954a4d24-8c7e-4382-9861-2b5d1a515253" -> null
          - namespace = "correspondence" -> null
        }
    }

  # kubernetes_role_binding_v1.correspondence_sp_access will be destroyed
  # (because kubernetes_role_binding_v1.correspondence_sp_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "correspondence_sp_access" {
      - id = "correspondence/github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "18255995" -> null
          - uid              = "21a23231-a010-46f6-8970-1f64ecb42334" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "github-sp-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "e36ca3b3-f495-45a5-bca4-4fc83424633f" -> null
          - namespace = "correspondence" -> null
        }
    }

  # kubernetes_role_binding_v1.dev_access["core"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "4dde4651-a9ca-4df1-9e05-216272284c7d"
          + namespace = "core"
        }
    }

  # kubernetes_role_binding_v1.dev_access["correspondence"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "954a4d24-8c7e-4382-9861-2b5d1a515253"
          + namespace = "correspondence"
        }
    }

  # kubernetes_role_binding_v1.dev_access["dialogporten"] will be created
  + resource "kubernetes_role_binding_v1" "dev_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "dev-access"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "dev-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "c403060d-5c8a-41b0-8c19-84fa60d0ce18"
          + namespace = "dialogporten"
        }
    }

  # kubernetes_role_binding_v1.dialogporten_dev_access will be destroyed
  # (because kubernetes_role_binding_v1.dialogporten_dev_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "dialogporten_dev_access" {
      - id = "dialogporten/dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "15722391" -> null
          - uid              = "a84f5be8-6893-4d0b-adb3-d9ecc509af21" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "dev-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "c403060d-5c8a-41b0-8c19-84fa60d0ce18" -> null
          - namespace = "dialogporten" -> null
        }
    }

  # kubernetes_role_binding_v1.dialogporten_sp_access will be destroyed
  # (because kubernetes_role_binding_v1.dialogporten_sp_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "dialogporten_sp_access" {
      - id = "dialogporten/github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "15722390" -> null
          - uid              = "e0fb6952-0977-44db-85f5-da0ff6780b21" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "github-sp-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "b22b612d-9dc5-4f8b-8816-e551749bd19c" -> null
          - namespace = "dialogporten" -> null
        }
    }

  # kubernetes_role_binding_v1.sp_access["core"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "e87d6f10-6fc0-4a09-a9b0-e8c994ed4052"
          + namespace = "core"
        }
    }

  # kubernetes_role_binding_v1.sp_access["correspondence"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "e36ca3b3-f495-45a5-bca4-4fc83424633f"
          + namespace = "correspondence"
        }
    }

  # kubernetes_role_binding_v1.sp_access["dialogporten"] will be created
  + resource "kubernetes_role_binding_v1" "sp_access" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "github-sp-access"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "github-sp-access"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "Group"
          + name      = "b22b612d-9dc5-4f8b-8816-e551749bd19c"
          + namespace = "dialogporten"
        }
    }

Plan: 15 to add, 1 to change, 13 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`